# Exercises I

Create a notebook or python script named advanced_dataframes to do your work in for these exercises.

1. Run python -m pip install pymysql from your terminal to install the mysql client (any folder is fine)
2. cd into your exercises folder for this module and run echo env.py >> .gitignore
3. Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

4. Use your function to obtain a connection to the employees database.

In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import text, create_engine
import datetime
from pydataset import data

from env import get_connection

In [2]:
url = get_connection('employees')
engine = create_engine(url)
employees = text('''
        SELECT * FROM employees
        ''')
e = pd.read_sql(employees,engine.connect())

In [3]:
e.head(3)

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28

5. Once you have successfully run a query:

    a. Intentionally make a typo in the database url. What kind of error message do you see?

    b. Intentionally make an error in your SQL query. What does the error message look like?

In [4]:
# a. URL created using funtion. No errors
# b. SQL syntax error

6. Read the employees and titles tables into two separate DataFrames.

In [5]:
titles = text('''
        SELECT * FROM titles
        ''')
t = pd.read_sql(titles,engine.connect())
t.head(3)

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01

In [6]:
e.head(3)

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28

7. How many rows and columns do you have in each DataFrame? Is that what you expected?

In [7]:
e.info() # 300,024 rows & 6 columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB

In [8]:
t.info() # 443,308 rows & 4 columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

8. Display the summary statistics for each DataFrame.

In [9]:
e.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [10]:
t.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

9. How many unique titles are in the titles DataFrame?

In [11]:
t['title'].nunique()

7

In [12]:
t['title'].unique()

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff',
       'Assistant Engineer', 'Technique Leader', 'Manager'], dtype=object)

10. What is the oldest date in the to_date column?

In [13]:
t.sort_values(by='to_date',ascending=True).head(3)

        emp_no     title   from_date     to_date
16064    20869  Engineer  1985-02-17  1985-03-01
406358  474918  Engineer  1985-02-10  1985-03-11
346216  434232     Staff  1985-02-26  1985-03-20

11. What is the most recent date in the to_date column?

In [14]:
#t['to_date'].dtype
dt = t['to_date'] != datetime.date(9999, 1, 1)
t[dt].sort_values(by='to_date',ascending=False).head(5)

        emp_no             title   from_date     to_date
154568  204324  Technique Leader  1985-02-10  2002-08-01
119478   90666          Engineer  1997-08-01  2002-08-01
387242  461960             Staff  1997-08-01  2002-08-01
319569  416185             Staff  1999-10-28  2002-08-01
67905    55876             Staff  1995-08-01  2002-08-01

# Exercises II

1. Copy the users and roles DataFrames from the examples Copy the users and roles DataFrames from the examples above.above.

In [15]:
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [16]:
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

2. What is the result of using a right join on the DataFrames?

In [17]:
users.merge(roles,how='right',left_on='role_id',right_on='id')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

In [18]:
# The join will keep all of the information contained within the table listed inside merge, or the 'right' table, regardless of whether a
# match is found or not

3. What is the result of using an outer join on the DataFrames?

In [19]:
users.merge(roles,how='outer',left_on='role_id',right_on='id')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

In [20]:
# Every bit of information is kept even when a match isnt found.

4. What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [21]:
# would not be able to merge because there is no data in common between tables to merge on

5. Load the mpg dataset from PyDataset.

In [22]:
mpg = data('mpg')
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

6. Output and read the documentation for the mpg dataset.

In [23]:
data('mpg',show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

7. How many rows and columns are in the dataset?

In [24]:
mpg.info() # 234 rows & 11 columns

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   cty           234 non-null    int64
 8   hwy           234 non-null    int64
 9   fl            234 non-null    object
 10  class         234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

8. Check out your column names and perform any cleanup you may want on them.

In [25]:
mpg.head()
new_name = {'displ':'displacement',
            'cyl':'cylinders'}
mpg = mpg.rename(columns = new_name)

9. Display the summary statistics for the dataset.

In [26]:
mpg.describe()

       displacement         year   cylinders         cty         hwy
count    234.000000   234.000000  234.000000  234.000000  234.000000
mean       3.471795  2003.500000    5.888889   16.858974   23.440171
std        1.291959     4.509646    1.611534    4.255946    5.954643
min        1.600000  1999.000000    4.000000    9.000000   12.000000
25%        2.400000  1999.000000    4.000000   14.000000   18.000000
50%        3.300000  2003.500000    6.000000   17.000000   24.000000
75%        4.600000  2008.000000    8.000000   19.000000   27.000000
max        7.000000  2008.000000    8.000000   35.000000   44.000000

10. How many different manufacturers are there?

In [27]:
mpg['manufacturer'].nunique()

15

11. How many different models are there?

In [28]:
mpg['model'].nunique()

38

12. Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [29]:
mpg['mileage_difference'] = mpg['hwy']-mpg['cty']
mpg.head()

,manufacturer,model,displacement,year,cylinders,trans,drv,cty,hwy,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10

13. Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [30]:
mpg['average_mileage'] = (mpg['hwy'] + mpg['cty'])/2
mpg.head()

,manufacturer,model,displacement,year,cylinders,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0

14. Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [31]:
# mpg['is_automatic'] = mpg[]
auto = np.where(mpg['trans'].str.startswith('a'),True,False)
mpg['is_automatic'] = auto
mpg
new_trans = auto = np.where(mpg['trans'].str.startswith('a'),'auto','manual')
mpg['trans'] = new_trans
mpg

,manufacturer,model,displacement,year,cylinders,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto,f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual,f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual,f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto,f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto,f,16,26,p,compact,10,21.0,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto,f,19,28,p,midsize,9,23.5,True
231,volkswagen,passat,2.0,2008,4,manual,f,21,29,p,midsize,8,25.0,False
232,volkswagen,passat,2.8,1999,6,auto,f,16,26,p,midsize,10,21.0,True
233,volkswagen,passat,2.8,1999,6,manual,f,18,26,p,midsize,8,22.0,False
234,volkswagen,passat,3.6,2008,6,auto,f,17,26,p,midsize,9,21.5,True

15. Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [32]:
mpg.groupby(by='manufacturer')['average_mileage'].mean().sort_values(ascending = False).head(3)

manufacturer
honda         28.500000
volkswagen    25.074074
hyundai       22.750000
Name: average_mileage, dtype: float64

16. Do automatic or manual cars have better miles per gallon?

In [33]:
mpg.groupby(by='is_automatic')['average_mileage'].mean().sort_values(ascending = False).head(3)

is_automatic
False    22.227273
True     19.130573
Name: average_mileage, dtype: float64

In [34]:
# manual cars on average get about 3 extra miles per gallon

# Exercises III

1. Use your get_db_url function to help you explore the data from the chipotle database.

In [38]:
url = get_connection('chipotle')
engine = create_engine(url)
tables = text('''
        SHOW TABLES
        ''')
chipotle_tables = pd.read_sql(tables,engine.connect())
chipotle_tables

  Tables_in_chipotle
0             orders

In [39]:
orders = text('''
        SELECT * FROM orders
        ''')
o = pd.read_sql(orders,engine.connect())
o

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98
...,...,...,...,...,...,...
4617,4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75
4618,4619,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75
4619,4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Guacamole, Lettuce]]",$11.25
4620,4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettuce]]",$8.75
4621,4622,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Lettuce]]",$8.75

2. What is the total price for each order?

In [40]:
o['item_price']

0        $2.39
1        $3.39
2        $3.39
3        $2.39
4       $16.98
         ...
4617    $11.75
4618    $11.75
4619    $11.25
4620     $8.75
4621     $8.75
Name: item_price, Length: 4622, dtype: object

3. What are the most popular 3 items?

In [44]:
o['item_name'].value_counts().head()

Chicken Bowl           726
Chicken Burrito        553
Chips and Guacamole    479
Steak Burrito          368
Canned Soft Drink      301
Name: item_name, dtype: int64

In [ ]:
# Chicken Bowl is the most ordered item

4. Which item has produced the most revenue?

In [61]:
o['price'] = o['item_price'].str.replace('$','').astype(float)
o.groupby(by='item_name')['price'].sum().sort_values(ascending=False).head(3)

/var/folders/m4/_r30hp156kj90s9_qf1t1zvc0000gn/T/ipykernel_91114/1974072994.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  o['price'] = o['item_price'].str.replace('$','').astype(float)

item_name
Chicken Bowl       7342.73
Chicken Burrito    5575.82
Steak Burrito      3851.43
Name: price, dtype: float64

5. Join the employees and titles DataFrames together.

In [71]:
url = get_connection('employees')
engine = create_engine(url)
e_t = text('''
        SELECT * FROM employees as e
        JOIN titles as t
            ON e.emp_no = t.emp_no
        ''')
et = pd.read_sql(e_t,engine.connect())
et

,emp_no,birth_date,first_name,last_name,gender,hire_date,emp_no,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,10001,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,10002,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,10003,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,10004,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,10004,Senior Engineer,1995-12-01,9999-01-01
...,...,...,...,...,...,...,...,...,...,...
443303,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,499997,Engineer,1987-08-30,1992-08-29
443304,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,499997,Senior Engineer,1992-08-29,9999-01-01
443305,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,499998,Senior Staff,1998-12-27,9999-01-01
443306,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,499998,Staff,1993-12-27,1998-12-27
443307,499999,1958-05-01,Sachin,Tsukuda,M,1997-11-30,499999,Engineer,1997-11-30,9999-01-01

6. For each title, find the hire date of the employee that was hired most recently with that title.

In [72]:
et.groupby(by = 'title')['hire_date'].max()

title
Assistant Engineer    1999-12-24
Engineer              2000-01-28
Manager               1992-02-05
Senior Engineer       2000-01-01
Senior Staff          2000-01-13
Staff                 2000-01-12
Technique Leader      1999-12-31
Name: hire_date, dtype: object

7. Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)

In [70]:
url = get_connection('employees')
engine = create_engine(url)
etd = text('''
        SELECT * FROM employees as e
        JOIN titles as t
            ON e.emp_no = t.emp_no
        JOIN dept_emp as DE
            ON DE.emp_no = e.emp_no
        ''')
etd = pd.read_sql(etd,engine.connect())
etd

,emp_no,birth_date,first_name,last_name,gender,hire_date,emp_no,title,from_date,to_date,emp_no,dept_no,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,10001,Senior Engineer,1986-06-26,9999-01-01,10001,d005,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,10002,Staff,1996-08-03,9999-01-01,10002,d007,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,10003,Senior Engineer,1995-12-03,9999-01-01,10003,d004,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,10004,Engineer,1986-12-01,1995-12-01,10004,d004,1986-12-01,9999-01-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,10004,Senior Engineer,1995-12-01,9999-01-01,10004,d004,1986-12-01,9999-01-01
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
489898,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,499997,Engineer,1987-08-30,1992-08-29,499997,d005,1987-08-30,9999-01-01
489899,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,499997,Senior Engineer,1992-08-29,9999-01-01,499997,d005,1987-08-30,9999-01-01
489900,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,499998,Senior Staff,1998-12-27,9999-01-01,499998,d002,1993-12-27,9999-01-01
489901,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,499998,Staff,1993-12-27,1998-12-27,499998,d002,1993-12-27,9999-01-01
489902,499999,1958-05-01,Sachin,Tsukuda,M,1997-11-30,499999,Engineer,1997-11-30,9999-01-01,499999,d004,1997-11-30,9999-01-01

In [69]:
tables = text('''
        SHOW TABLES
        ''')
pd.read_sql(tables,engine.connect())

  Tables_in_employees
0         departments
1            dept_emp
2        dept_manager
3           employees
4            salaries
5              titles

In [75]:
t = pd.crosstab(etd['dept_no'],etd['title'])
t

title,Assistant Engineer,Engineer,Manager,Senior Engineer,Senior Staff,Staff,Technique Leader
dept_no,,,,,,,
d001,0,0,2,0,13940,16196,0
d002,0,0,2,0,12139,13929,0
d003,0,0,2,0,12274,14342,0
d004,6445,49649,4,42205,1270,1478,6557
d005,7769,58135,2,49326,1247,1424,7683
d006,1831,13852,4,11864,0,0,1795
d007,0,0,2,0,36191,41808,0
d008,378,2986,2,2570,11637,13495,393
d009,298,2362,4,2027,13925,16150,309

In [77]:
t.sum(axis = 1)

dept_no
d001     30138
d002     26070
d003     26618
d004    107608
d005    125586
d006     29346
d007     78001
d008     31461
d009     35075
dtype: int64

In [79]:
etd.groupby(by='dept_no')['title'].count()

dept_no
d001     30138
d002     26070
d003     26618
d004    107608
d005    125586
d006     29346
d007     78001
d008     31461
d009     35075
Name: title, dtype: int64